{"EAAB6ppltBWQBABGMsNiZAAJmZCbG2HVvJEGKrfYHamWO5x1zv3scGLOB5mW3JmjbaCXxgFjtEizXQINIj0lmvOd2XDa4BqiA8xI7upWgrmzcBsGDRgDNycYqIF7QXznJeQWeFqoNvbLnlck5aiZCuV6W3umD1ZCEZCjiagZCI96htl60MafOG6LkeVIKCfIrKoVwYtVRZCOjQZDZD": [{"description": "Your favorite JB's first (jk second, but who goes out on monday's) day of legality just so happens to fall on the last day of classes. Get ready to stay up past her 10:30 bedtime and celebrate with ~tequila~ sodas galore.  Dr. Jord is out of the lab, and her embroidered scrubs, and ready to show Sylvia (her dead Bonzai, for those of you who are uninformed) her wild side.\n\n**Whoever keeps Jordana from compulsively cleaning the longest gets a shot on us.**\n\nBYOL (bring your own limes)\n...and BYOB \n......and/or BYOW if you're into that", "name": "Jordana Browns Out ", "place": {"name": "Zaragon Place", "location": {"city": "Ann Arbor", "country": "United States", "latitude": 42.27417, "longitude": -83.7354, "state": "MI", "street": "619 E University Ave", "zip": "48104"}, "id": "11859743562"}, "start_time": "2017-12-12T21:30:00-0500", "id": "2034775723412434", "rsvp_status": "attending"}, {"description": "Your fav wine conniosseur is turning 21 so stop and smell the rosé and let's get wine turnt! There will obviously be large amounts of wine and a concoction for those that keep wining about the wine but dranks are limited so definitely BYOB to get lit. Ricks push after midnight if you're 21 Savage!! \n\nP.S. Door code is #002", "name": "Wine Fiend Turns 21!", "place": {"name": "401 Thompson St Apt 808"}, "start_time": "2017-11-17T22:00:00-0500", "id": "1635962276447169", "rsvp_status": "attending"}, {"description": "Hola Pandejos, Thursday is going to be una grande FIESTA, as the locals would say. Una grande vat of Margaritas will be made but supplies are limited. \n\nCome fiesta with us", "name": "Brendan skinner’s Thirsty Thursday Tequila Fiesta Party ", "place": {"name": "1619 S University Ave, Ann Arbor, MI 48104-2620, United States"}, "start_time": "2017-11-09T22:00:00-0500", "id": "387127785040531", "rsvp_status": "attending"}, {"description": "Calling all basic witches! Join 502 post-win-against-Rutgers in a spooktacular night of ~mysterie~. Come in your best costume, bring your best alcohol, and be ready to celebrate the big 4-0 (if u know, u know)\n\ndoor code: 280\nBYOB (there will be some spooky punch tho)\n\n18 to enter\n21 to haunt\n40 to be the guest of honor", "name": "Dirty502 Haunting presents: THE BIG BANG", "place": {"name": "502 zgon"}, "start_time": "2017-10-28T21:00:00-0400", "id": "180986779129463", "rsvp_status": "attending"}, {"description": "Come and Celebrate your fav engineer as she turns the big 2-1!!!!!!! Pregame at our place and then SKEEPS PUSH to follow!!!! \n\nTheme: TOFTB (Tongues Out For The Boys) \n\n21+ drink\n18+ to play pin the tongue on meg", "name": "Meghan's 21st Birthday Pregame!!!!", "place": {"name": "713 Church St, Ann Arbor, MI 48104-3109, United States"}, "start_time": "2017-10-03T22:00:00-0400", "id": "535001690225254", "rsvp_status": "attending"}, {"description": "Join the brothers of Delta Tau Delta for the first annual Dunk a Delt philanthropy event! You'll have the opportunity to dunk some of your favorite (and least favorite) brothers into a dunk tank, so come join us out on the diag from 10am-2pm. You'll also get the chance to learn about our national philanthropy, JDRF, the nations leading type 1 diabetes charity. Hope to see you then!\n\nMore information on JDRF: http://www.jdrf.org/\nPlease contact estraus@umich.edu with any questions.", "end_time": "2017-09-22T14:00:00-0400", "name": "Delta Tau Delta presents: Dunk a Delt!", "place": {"name": "Michigan Diag", "location": {"city": "Ann Arbor", "country": "United States", "latitude": 42.277267915, "longitude": -83.738295705, "state": "MI", "street": "913 S. University Ave."}, "id": "129580773850141"}, "start_time": "2017-09-22T10:00:00-0400", "id": "1683647034979928", "rsvp_status": "attending"}, {"description": "The Soup Kitchen (Noun): \"When a group of 4 or more bums have an orgy in a vehicle.\" - Lord Miriam Webster , creator of the Dictionary \n\nWe have two who are 21, but are in need of two more. Please contact Connor Lang if you have any leads. \n\nOur house is celebrating the cumming of age of Alex “Big” Wood and Josh Dicker. They’ve made it through cracked heads and snapped fakes and have finally made it to the other side. A ricks push will be the postgame for this event. Come for the vivacious conversation of Josh Dicker, stay to see Wood climb a tree. \n\nContrary to popular belief there will be no free soup (BYOB). \n\nHouse rules: \n- shoes are optional \n- 18 to touch Dicker’s gut\n- 21 to touch Alex’s wood", "name": "The Soup Kitchen presents Josh and Wood's Cumming of Age", "place": {"name": "1619 S University Ave, Ann Arbor, MI 48104-2620, United States"}, "start_time": "2017-09-14T21:00:00-0400", "id": "496144214063058", "rsvp_status": "attending"}, {"description": "Your favorite boys at 1517 South U are having one last banger to end the year off! Come drink away the final you just failed, or pregame the one youre about to. Tis the season for pong on the porch. BYOB.", "name": "1517 gets DICKERED", "place": {"name": "1517 S University Ave, Ann Arbor, MI 48104-2618, United States"}, "start_time": "2017-04-21T22:30:00-0400", "id": "404499793252836", "rsvp_status": "attending"}, {"description": "Did you really think we would end the year without a final get together?? Finals are kicking us in the booty and we're getting sappy about being seniors so let's drink!!!! We will not be accepting any excuses so close your books, call in sick to work, and make your final Falsetta's run... SEE YOU SOON!!", "name": "IMPROMPTU PROCASTINATION CELEBRATION", "place": {"name": "504 Walnut St, Ann Arbor, MI 48104-2530, United States"}, "start_time": "2017-04-21T22:00:00-0400", "id": "1323282341099836", "rsvp_status": "attending"}, {"description": "Come On Out To prEgame Rick's for one of the last times of the year with your favorite group of disappointments. Crying about graduation is allowed.  BYOB so feel free to sneak into Meisel's room and see what you can find (Update: there will be a keg but Thomas is having a tough time parting ways with that joke). We'll be on the lawn but please keep in mind that this is a family neighborhood so no fucking swearing.\n\nRyan Alford** has volunteered to be our line spotter so you'll know exactly when to get in line. Thank you Ryan you tender-hearted young man. Ryan Foley you are dead to us.", "end_time": "2017-04-22T03:00:00-0400", "name": "Pink Taco means WHAT?? Pregame", "place": {"name": "701 S Forest Ave, Ann Arbor, MI 48104-3116, United States"}, "start_time": "2017-04-21T20:00:00-0400", "id": "186883125162747", "rsvp_status": "attending"}, {"description": "MUSIC Matters + UMusic Experience are proud to present the SpringFest 2017 headlining concert at Crisler Center featuring 2 Chainz, Lil Yachty, & Desiigner! \n\nTickets ON SALE AT 10 AM ON 3/23. Student ticket prices only available at MUTO with a valid student ID.  or online at umichmusicmatters.com/tix\n\nTICKET PRICES (Student / Non-Student):\n\nEARLY BIRD TICKETS AVAILABLE: The first 500 lower bowl tickets are $29.99 EACH.\n\nVIP: $99.99 / $119.99\nFloor: $49.99 / $59.99\nLower Bowl: $34.99 / $44.99\nUpper Bowl: $19.99 / $29.99\n\nA VIP Ticket includes:\n1 Premium reserved ticket in the first 5 rows\n1 Commemorative VIP Laminate & Lanyard\n1 Limited-edition SpringFest merchandise gift, exclusively for VIP guests\nAccess to a designated VIP entrance \nAccess to VIP Lounge in the Weiser Club with appearances by celebrity guests\nComplementary water and snacks in the VIP lounge\n\nRead more about the event here: https://www.michigandaily.com/section/arts/springfest-announcement\n\nA portion of proceeds will go towards supporting MUSIC Matters' MOvE: Michigan Overnight Experience, a two day long program launching in August 2017 at U of M's campus aiming to provide high schoolers with an opportunity to learn what our school - and college as a whole - has to offer and how they can get there.\n\nThis show is made possible by our sponsors: \n\nClorox, Goldman Sachs, Foundry Lofts, Coca-Cola, and Landmark apartments.\n                                \nUniversity of Michigan \n\nOffice of the Provost, Office of the President, College of Literature, Science, and the Arts, The School of Information, The College of Engineering, The Ross School of Business, Central Student Government, School of Music, Theater, and Dance, LSA Student Government, School of Music, Theater, and Dance, LSA Student Government, The School of Public Health, Alumni Association, Residential Hall Association, The School of Kinesiology, The College of Pharmacy, Office of Student Life, Arts at Michigan, The School of Nursing, Law School, The School of Dentistry, Office of University Development, Penny W. Stamps School of Art and Design", "end_time": "2017-04-14T23:00:00-0400", "name": "MM + UMusic Present: 2 Chainz, Lil Yachty, & Desiigner", "place": {"name": "Crisler Center", "location": {"city": "Ann Arbor", "country": "United States", "latitude": 42.265037, "longitude": -83.746768, "state": "MI", "street": "333 E Stadium Blvd", "zip": "48109"}, "id": "213437955421408"}, "start_time": "2017-04-14T19:00:00-0400", "id": "1671215729838773", "rsvp_status": "attending"}, {"description": "The moment you've all been waiting for.... At long last Wass and Siegel (better known as Dong and Shmiegel) are turning 21 so come to state and hill and get rickety rickety wrecked son", "name": "State and Hill's two babies turn 21 (Jewish Saint Patricks Day)", "place": {"name": "704 Hill St, Ann Arbor, MI 48104-3304, United States"}, "start_time": "2017-03-17T21:30:00-0400", "id": "1876704949240214", "rsvp_status": "attending"}, {"description": "It’s March, do you know what that means?? Delt Madness is making its return. If you’d like to play, venmo $6 to @Delt-Madness. Include your email as the description so that we can add you to the ESPN group. If you’d like to submit more than one bracket, just venmo $6 per entry, and there is no limit to how many brackets you can submit.\n\n$5 of the $6 entry fee will be donated to JDRF, our national philanthropy. JDRF is the leading global organization funding Type 1 diabetes research. The remaining dollar of every entry will be placed into a pool, and the winner will get the entire pool at the end of the tournament.\n\nPlease contact Eli Straus at estraus@umich.edu if you have any questions.", "end_time": "2017-03-26T18:00:00-0400", "name": "Delt Madness 2017!", "start_time": "2017-03-12T18:00:00-0400", "id": "281718845591880", "rsvp_status": "attending"}, {"description": "DTD is having a fundraiser Pizza House for JDRF, the leading global organization that funds Type 1 diabetes research! Do some good for the community while eating some amazing pizza.\n\nMention \"DTD\" to anyone working for Pizza House-- whether you're eating in, carrying out, or ordering delivery!", "end_time": "2017-02-24T04:00:00-0500", "name": "DTD Pizza House Fundraiser!", "place": {"name": "Pizza House", "location": {"city": "Ann Arbor", "country": "United States", "latitude": 42.27427, "longitude": -83.73495, "state": "MI", "street": "618 Church St", "zip": "48104"}, "id": "99087490368"}, "start_time": "2017-02-23T10:30:00-0500", "id": "1271534879559831", "rsvp_status": "unsure"}, {"description": "It's a party! Roll through!", "name": "1612 Washtenaw Fiesta!", "place": {"name": "1612 Washtenaw Ave, Ann Arbor, MI 48104-3522, United States"}, "start_time": "2017-01-28T22:00:00-0500", "id": "1095184423937126", "rsvp_status": "attending"}, {"description": "Gamma Phi Beta at the University of Michigan is excited to host our signature philanthropy event, Moonball ™, a volleyball tournament that supports our philanthropic focus of Building Strong Girls, where proceeds will benefit our international philanthropic partner, Girls on the Run!\n\nInterested in playing in our Moonball tournament? \nRegister your team today here: https://docs.google.com/forms/d/e/1FAIpQLSeMnw2CcHiNP_f9njmWJofh93mDUaBXrLxfkKnzAHDzMcfPkQ/viewform\n\nRegistration Fee: $90 for team of 6 +2 alternates before January 22nd, 2017. After January 22nd, $120.\n\nThe first and second place teams will win donations to a charity of their choice in addition to other prizes!\n\nFor more information, contact our Philanthropy Chairwoman Becca Weintrob at gpbumichphilanthropy@gmail.com!", "end_time": "2017-01-28T16:00:00-0500", "name": "Gamma Phi Beta Moonball", "place": {"name": "UM Intramural Sports Building", "location": {"city": "Ann Arbor", "country": "United States", "latitude": 42.269571709866, "longitude": -83.742412238303, "state": "MI", "street": "606 E Hoover Ave", "zip": "48104"}, "id": "200062403346876"}, "start_time": "2017-01-28T12:00:00-0500", "id": "192428297895126", "rsvp_status": "attending"}, {"description": "The dynasty continues. \nCome celebrate the G.O.A.T. COACH JIM HARBAUGH and the end of his second season with the brothers of Delta Tau Delta Fraternity.\n\nBring khakis, clipboards, jerseys, and tailgate outfits. Rip off your puffy jackets at the door! Have a meltdown and scream at the refs! Harbaugh!\n\nParty starts at 10:30pm. Harbaugh will be making another guest appearance.\n\n21+ to drink\n18+ to love Harbaugh\n\nIf you're interested in Winter Rush or have any questions, feel free to contact our rush chair Noah Gillen at (401) 474-4818 or ngillen@umich.edu.", "end_time": "2017-01-08T04:00:00-0500", "name": "Harbaugh Tau Harbaugh III", "place": {"name": "1928 Geddes Ave, Ann Arbor, MI 48104-1799, United States"}, "start_time": "2017-01-07T22:30:00-0500", "id": "1056515984454435", "rsvp_status": "attending"}, {"description": "https://www.gofundme.com/huffnagle-chest-shave-fundraiser\n\nPlease come pregame for Rick's/donate to our GoFundMe page as we raise money to shave his chest. If you're the biggest giver, you can shave his chest yourself. \n\nhttps://www.gofundme.com/huffnagle-chest-shave-fundraiser", "name": "Pregame Fundraiser To Help Huffnagle Shave His Chest", "place": {"name": "701 S Forest Ave, Ann Arbor, MI 48104-3116, United States"}, "start_time": "2017-01-06T20:00:00-0500", "id": "1358195977534594", "rsvp_status": "attending"}, {"description": "Address of house will be posted December 31 by 3pm! \nVenmo $20 to Samantha Simpson \nInvite list will be accounted for over venmo- no venmo, no entry\nAlc will be provided...but you can never have enough so BYOB too\n\nIf you'd like to add someone to the list message a host, but this is a private party so please be respectful of Sammy and do not spread this around or invite whoever you please \n\n2017 here we come!!!!", "name": "NYE House Party", "place": {"name": "TBA, Wrigleyville"}, "start_time": "2016-12-31T22:00:00-0600", "id": "1321352404590164", "rsvp_status": "attending"}, {"description": "Last party of the year! Last party of the semester! Time for a study break and celebration. Get your Christmas sweaters, or not, and get ready to dash through the snow and party your ass off because this shit is gonna be lit!", "end_time": "2016-12-17T02:00:00-0500", "name": "Christmas Banger!", "place": {"name": "1612 Washtenaw Ave, Ann Arbor, MI 48104-3522, United States"}, "start_time": "2016-12-16T22:00:00-0500", "id": "395790324086664", "rsvp_status": "attending"}, {"description": "Whilst we were getting figgity at bance, a loved one was kidnapped from our home.  We searched high and low but all we could find was the half empty can of Hamm's on our porch step.  After drowning our sorrows, we devised a plan of action:\n\nStep 1: Have a candlelit vigil\nStep 2: Revenge\nStep 3: GET FIGGITY CAUSE OUR RUSH NUT BANNER IS BACK bitch\n\nour banner is home\nyou messed with the wrong frat, boi\nwe know it was you\n\n(**** **** is a bitch)\n\nBYOB and get ready to grind on me ;)", "name": "Welcome Back", "place": {"name": "504 Walnut St, Ann Arbor, MI 48104-2530, United States"}, "start_time": "2016-11-12T22:00:00-0500", "id": "1074156516034611", "rsvp_status": "attending"}, {"description": "Join the brothers of Delta Tau Delta fraternity as they welcome two new members, Christopher Fox and Christopher Petzold into the brotherhood this Saturday night.  Its going to be huge.  6'6\", 320 pounds huge.", "end_time": "2016-10-30T04:30:00-0400", "name": "Chris Fox and Petzold Bid Night Party", "place": {"name": "Delta Tau Delta Fraternity", "location": {"city": "Ann Arbor", "country": "United States", "latitude": 42.2752, "longitude": -83.72357, "state": "MI", "street": "1928 Geddes Ave", "zip": "48104"}, "id": "164557727016131"}, "start_time": "2016-10-29T22:00:00-0400", "id": "616475845189900", "rsvp_status": "attending"}, {"description": "Hey so we live really close to Rick's so before you go to Rick's we should drink together here. cool\n\nalso Stu Daudlin and Elliott Clark are turning 21 which is also really cool", "name": "Pink Taco And Rick's Are Really Close to Eachother", "place": {"name": "701 S Forest Ave, Ann Arbor, MI 48104-3116, United States"}, "start_time": "2016-09-30T20:30:00-0400", "id": "168039300307861", "rsvp_status": "attending"}, {"description": "...exclaimed an ecstatic Damstetter one evening while at the Jug.  So, do you? If you're subconsciously raising your hand right now you have no choice but to be at our party.  Help us break in the Rite Nut with some US peer bong league style ratchetry. Keep your belongings close or Gin might mod podge them for her next project. Felkey and Mtak might be passed out on the ground surrounded by capri suns and InnStix, so watch your step. Rocco's squash practice has been a little intense lately so lets get her blacked. Erin thinks she's better than vodka so she'll probably be drinking tequila on her yoga mat. \n\nBYOB, BYOMG, and BYON\n\nAs Em always says, \"one more shot before we leave,\" so when you think you've pregamed enough, remember what the Rite NUT would do, and take one more.\n\nHarambe is dead, \nFiggity figgity fuck,\nHarbaugh, my savior.", "end_time": "2016-09-24T02:00:00-0400", "name": "RAISE YOUR HAND IF YOU LOVE THE UNIVERSITY OF MICHIGAN", "place": {"name": "504 Walnut St, Ann Arbor, MI 48104-2530, United States"}, "start_time": "2016-09-23T22:00:00-0400", "id": "250923698638362", "rsvp_status": "attending"}, {"description": "Labor day is upon us. Soon the leaves will be changing, snow and ice will frighten the Californians, and flocks of Canadian Geese will storm campus. But before all of that happens, the brothers of Delta Tau Delta will be having a big one, one last summer celebration.  \r\n\r\nCome celebrate the end of summer in your gaudiest hawaiian shirts and bathing suits. Doors open at 10pm.\r\n\r\n18 to party\r\n21 to drink\r\nRemember your Mcards\r\n\r\nFor rush info, contact Jack Daffada at (847) 436-3492 or jdaffada@umich.edu. You can also visit https://greeklife.umich.edu/article/joining-interfraternity-council\r\n\r\nDeltaration of Independence: https://www.facebook.com/events/299836587063419/", "end_time": "2016-09-05T01:00:00-0400", "name": "Delta Tau Delta Presents: Deltona Beach", "place": {"name": "Delta Tau Delta Fraternity", "location": {"city": "Ann Arbor", "country": "United States", "latitude": 42.2752, "longitude": -83.72357, "state": "MI", "street": "1928 Geddes Ave", "zip": "48104"}, "id": "164557727016131"}, "start_time": "2016-09-04T22:00:00-0400", "id": "1634728110172893", "rsvp_status": "attending"}, {"description": "The Olympics have come to a close, and as per usual, the United States is on top. What better way to celebrate than by breaking out anything red white and blue and having a cold one at the Deltaration of Independence with the brothers of Delta Tau Delta. \r\n\r\n18+ to party\r\n21+ to drink \r\nBring your MCards\r\n\r\nFor rush info, contact Jack Daffada at (847) 436-3492 or jdaffada@umich.edu. You can also visit https://greeklife.umich.edu/article/joining-interfraternity-council\r\n\r\nDeltona Beach: https://www.facebook.com/events/1634728110172893/", "end_time": "2016-09-03T01:00:00-0400", "name": "Delta Tau Delta Presents: The Third Annual Deltaration of Independence", "place": {"name": "Delta Tau Delta Fraternity", "location": {"city": "Ann Arbor", "country": "United States", "latitude": 42.2752, "longitude": -83.72357, "state": "MI", "street": "1928 Geddes Ave", "zip": "48104"}, "id": "164557727016131"}, "start_time": "2016-09-02T22:00:00-0400", "id": "299836587063419", "rsvp_status": "attending"}, {"description": "The Pink Taco welcomes you to celebrate the 21st birthday of Arjan Mustafa Abar and Thomas Christian Hislop. There will be light refreshments and a shirtless Ryan Huffnagle. In lieu of gifts, please bring beverages/donate to the Cincinnati Zoo in honor of Harambe.", "name": "Thomas and Arjan Turn 13!!! Pregame", "place": {"name": "701 S Forest Ave, Ann Arbor, MI 48104-3116, United States"}, "start_time": "2016-08-30T21:00:00-0400", "id": "619874024848848", "rsvp_status": "attending"}, {"description": "As we near the end of the school year, come party one last time before finals with the brothers of Delta Tau Delta Fraternity.\n\nWear your most ridiculous/colorful/tight/bright outfits and get ready for a night of flashing lights and raving. Rumors say that Harbaugh will be DJing. \n\nParty starts at 10:30pm. \n\n21+ to drink\n18+ to party", "name": "Delta Tau Delta Presents: Delt Rave", "place": {"name": "Delta Tau Delta Fraternity", "location": {"city": "Ann Arbor", "country": "United States", "latitude": 42.2752, "longitude": -83.72357, "state": "MI", "street": "1928 Geddes Ave", "zip": "48104"}, "id": "164557727016131"}, "start_time": "2016-04-09T22:30:00-0400", "id": "1262369713776675", "rsvp_status": "attending"}, {"description": "Big Ticket Productions is excited to announce that we will be bringing Lil Dicky and Vic Mensa to Hill Auditorium on April 2nd! \n\nTickets on sale NOW at the Michigan Union Ticket Office or at www.mutotix.com", "name": "Big Ticket Productions Presents: Lil Dicky and Vic Mensa", "place": {"name": "Hill Auditorium", "location": {"city": "Ann Arbor", "country": "United States", "latitude": 42.279, "longitude": -83.739, "state": "MI", "street": "825 North University Avenue", "zip": "48109"}, "id": "104050996298907"}, "start_time": "2016-04-02T20:00:00-0400", "id": "1505166883126280", "rsvp_status": "attending"}, {"description": "The Brothers of DU and DTD are proud to announce they\nwill be hosting the Second Annual Delta Dodgeball Tournament on Saturday April 2 at 1 pm at the front lawn of DU (1331 Hill St). The registration deadline will be Wednesday March 30.\n\nDelta Dodgeball is a single elimination dodgeball tournament. Any team of 6 can compete regardless of whether or not they are in Greek life. It will benefit the Huron Valley Boys and Girls Club and the JDRF. We ask you to join us in support of this great organization by joining us at Delta Dodgeball 2016. The winning team members will each receive a $25 gift card to Charleys.\n\nPlease go to https://www.gofundme.com/deltadodgeball to raise additional funds for the Huron Valley Boys and Girls Club and the JDRF. Teams that raise the most donations will earn rewards to be used during the tournament. Rewards will be announced soon. \n\nTeam sign up here: https://docs.google.com/a/umich.edu/forms/d/1ANQ_8xu5-sabrTjk-nVZeENYaisV14Tonuvb-qwiIko/viewform", "name": "Delta Dodgeball", "place": {"name": "Delta Upsilon Chapter at the University of Michigan", "location": {"city": "Ann Arbor", "country": "United States", "latitude": 42.27252, "longitude": -83.73214, "state": "MI", "street": "1331 Hill St", "zip": "48104"}, "id": "181845631832675"}, "start_time": "2016-04-02T13:00:00-0400", "id": "478110472361220", "rsvp_status": "attending"}, {"description": "just text me if you have my # please", "name": "lost contacts...again ", "start_time": "2016-03-17T00:00:00-0500", "id": "289456237806811", "rsvp_status": "attending"}, {"description": "Delt Madness is back! Venmo $6 to @delt-madness per bracket. Place your email in the payment description to receive an invite to the ESPN bracket group, which will be done nightly. Please be aware that your email must be linked to your ESPN account. If it is not, you may not receive the invitation for the bracket. \n\nIf you do not have an account, please create one prior to venmoing money. \n\n$5 of your $6 will be donated to JDRF, a type 1 diabetes research foundation. The other $1 will be pooled as prize money. There is no limit on the amount of brackets you can submit, just venmo for the amount of brackets you intend to submit. (If you wish to submit three brackets, venmo $18)\n\nThe 1st place winner will have their choice of the pooled money or a football signed by Coach Harbaugh. The second place winner will recieve the prize not chosen. \n\nContact Charlie Velis cjvelis@umich.edu if you have any questions.", "end_time": "2016-03-16T11:59:00-0400", "name": "Delt Madness", "start_time": "2016-03-10T00:00:00-0500", "id": "1885239378368996", "rsvp_status": "attending"}, {"description": "For 81 years, on a Saturday morning each Fall, one of Michigan's oldest traditions is on display on the corner of South University and Washtenaw. Every year since 1933, the same year President Ford played center for the national champion Wolverines, the University of Michigan community has celebrated the Michigan Mud Bowl. Even through a World War and an advent of Greek Life politics, this competitive rivalry game has been played every year. This year will be no different. Mudbowl is here.\n\nThe event has raised over $100,000 for C.S. Mott Children's Hospital in the last 5 years alone. We hope to raise a record amount this year in order to benefit those who need it most. Please feel free to donate below:\n\nhttps://www.gofundme.com/ra4s7xcg\n\nThe 82nd Annual Michigan Mud Bowl will take place Saturday October 10 - see you all there", "name": "82nd Annual Michigan Mudbowl", "place": {"name": "1408 Washtenaw Ave, Ann Arbor "}, "start_time": "2015-10-10T11:00:00-0400", "id": "861968207252117", "rsvp_status": "attending"}, {"description": "With the Fourth of July months past and the Olympics a year away, ask yourself, “Where am I going to be able to bust out that USA tank one last time?” The answer? The Deltaration of Independence. \n\nOn September 4th, 1928 Geddes is going all in for the red white and blue. Gear up in anything and everything American and party til you sound as wack as Donald Trump. \n\n21+ to drink\n18+ to Party/Vote\nBring your Mcards\n\n\n\nDeltona Beach\nhttps://www.facebook.com/events/1606815612914116/", "name": "Delta Tau Delta Presents: The Second Annual Deltaration of Independence", "place": {"name": "Delta Tau Delta Fraternity", "location": {"city": "Ann Arbor", "country": "United States", "latitude": 42.2752, "longitude": -83.72357, "state": "MI", "street": "1928 Geddes Ave", "zip": "48104"}, "id": "164557727016131"}, "start_time": "2015-09-04T22:00:00-0400", "id": "881074051960496", "rsvp_status": "attending"}, {"description": "AJ Marcus is an artist whose work blurs the line between photography and digital imaging. His processes involve the manipulation of captured images based on sensory stimulation: climate, music, nostalgia. He explores themes including the urban-rural dichotomy, youth, and worship of an idealized America. Notable work includes projects titled “The City Beautiful” and “…isms: an Interpretation”, both of which will be featured extensively at the show. \n\nEzra Miller is a new media artist working with code as a way of creating images, interactive websites, and generative art. His projects live on the web, and his works explore topics including feedback, algorithmic phenomena, and the aesthetics of the digital world.\n\nCome to Gallery 2 at the Latin School of Chicago between February 9th and 20th to see the show. There will be snacks and music as well as opportunities to talk with the artists during the reception on the 12th at 3:30. \n\nIn addition, Ezra will be releasing his latest project titled “MY SHARDS” on February 12th in the form of an interactive website. Stay tuned.", "end_time": "2015-02-20T15:20:00-0600", "name": "SENIOR ART SHOW: Ezra Miller & AJ Marcus", "place": {"name": "Latin School of Chicago Gallery 2"}, "start_time": "2015-02-09T08:00:00-0600", "id": "1548869975375673", "rsvp_status": "attending"}, {"description": "FRIDAY NIGHT 5:45-7:00\nLatin School Men's Basketball", "end_time": "2014-12-05T19:00:00-0600", "name": "LATIN Vs. PARKER", "place": {"name": "Mcgrath Arena", "location": {"city": "Chicago", "country": "United States", "latitude": 41.924013812131, "longitude": -87.653505702024, "state": "IL", "zip": "60614"}, "id": "366580160088937"}, "start_time": "2014-12-05T17:45:00-0600", "id": "1510204035918284", "rsvp_status": "attending"}, {"description": "Come to the third annual Awesome Club Dance… \nPark West 322 W. Armitage \n8-11:30pm: doors close 8:30\nPlease invite Latin students who did not get this and friends from other schools! Let Blake and Michael know if you plan on bringing guests. \n\n$10 cover\nHigh School ID's are required for entrance.\nBring extra $ for Awesome Club apparel.\n\nAll grades are welcome.\n\nHeadlining: Dj Toshi, DJ Ben Sullivan, and DJ Brumjutt (Guarav)\n\n100% of the proceeds from this event goes to the Northwestern Brain Tumor Institute and towards brain tumor research. So come out and party for a \"AWESOME\" cause!\n\nThe Latin School's Awesome Club, founded by Blake Lasky and Michael Berger, is a student run club supporting Northwestern Cancer Research, and the Louis Berger Foundation. Awesome Club's main goal is to spread awareness, and promote Northwestern Brain Institute.\n\n*Zero Tolerance Policy*\n\n\nDress to party hard\n\nSee you there!!", "end_time": "2013-04-12T23:30:00-0500", "name": "Awesome Club Dance 2013!!!", "place": {"name": "Park West", "location": {"city": "Chicago", "country": "United States", "latitude": 41.918521026926, "longitude": -87.637445442488, "state": "IL", "street": "322 W Armitage Ave", "zip": "60614"}, "id": "65467521495"}, "start_time": "2013-04-12T20:00:00-0500", "id": "194116277378630", "rsvp_status": "attending"}, {"description": "Amigos! Come to the second annual Awesome Club Dance… \nULTRA AWESOME Music Festival \n Park West 322 W. Armitage \n8-12pm: doors close 8:45\n\nPlease Invite Latin Students Who Did Not Get This\n\n$10 cover\nBring extra $ for Awesome Club Lax Pinnies, Ray-Bans, and wristbands \n\nAll Grades Welcome\n\nHeadlining: DJ Brumjutt (Guarav), DJ Ben Sullivan, and DJ Toshi\n\nThey’ll be pumping the beats all night for an incredible cause, Northwestern Brain Institute. 100% of the proceeds from the event will go to Northwestern and brain tumor research. Donations accepted. \n\nThe Latin School's Awesome Club, founded by Blake Lasky and Michael Berger, is a student run club supporting Northwestern Cancer Research, and the Louis Berger Foundation. Awesome Club's goal is to spread awareness, and promote Northwestern Brain Institute.\n\nZero Tolerance Policy: There will be security at the door, and bag check. You MUST have your student ID: no guests allowed without permission, there will be a list at the door.\n\nDress to party\nIt’s Going To Be AWESOME!!!!!", "end_time": "2012-05-12T00:00:00-0500", "name": "Awesome Clubs Annual Dance: ULTRA AWESOME Music Festival", "place": {"name": "Park West", "location": {"city": "Chicago", "country": "United States", "latitude": 41.918521026926, "longitude": -87.637445442488, "state": "IL", "street": "322 W Armitage Ave", "zip": "60614"}, "id": "65467521495"}, "start_time": "2012-05-11T20:00:00-0500", "id": "347383851984874", "rsvp_status": "attending"}, {"description": "costume preferred \nDj and food", "end_time": "2011-10-29T22:00:00-0400", "name": "Isabella and Oliver Shindler's Halloween Party", "start_time": "2011-10-29T19:00:00-0400", "id": "965388470168790", "rsvp_status": "attending"}, {"description": "Attire: semi nice. boys wear nice pants and a polo or something. girls wear a nice shirt and a skirt or something like that\n\n Also, please remind others in the grade without facebooks to RSVP to us, so we know who's coming.", "end_time": "2011-05-06T22:30:00-0400", "name": "Chris, Will N, Will VW, and Charlie C's Confirmation Party", "start_time": "2011-05-06T19:00:00-0400", "id": "825647050855021", "rsvp_status": "attending"}, {"description": "TWO STRAIGHT DAYS OF NO CLASSES", "end_time": "2011-02-03T23:30:00-0800", "name": "LATIN'S FIRST DOUBLE SNOW DAY!!!!!!! EVER!!!!!!!", "place": {"name": "Chicago, IL", "location": {"city": "Chicago", "country": "United States", "latitude": 41.8369, "longitude": -87.6844, "state": "IL"}, "id": "108659242498155"}, "start_time": "2011-02-02T00:00:00-0800", "id": "1047400995287490", "rsvp_status": "attending"}, {"description": "Everyone go to NBA.com and vote for Brian Scalabrine to go to the All star game.  Vote every day and we can get the most intense, fundamental, and hardworking man into the All star game.  Also, he leads the NBA in high fives.  He also has more championship ring than Lebron James.", "end_time": "2011-01-25T05:30:00-0500", "name": "VOTE BRIAN SCALABRINE", "start_time": "2010-12-29T02:30:00-0500", "id": "1030622566966761", "rsvp_status": "attending"}, {"description": "Masters Middle School Basketball had never beaten Hackley, and they are our rivals. Watch the Boy Middle School Basketball Team beat hackley", "end_time": "2010-02-23T16:30:00-0500", "name": "Masters vs. Hackley", "start_time": "2010-02-23T15:00:00-0500", "id": "10153177204022789", "rsvp_status": "attending"}]}
